//let hanhan=[];

let choindex, jungindex, jongindex;

	//초성(19)
const cho = [
['ㄱ'], ['ㄱ', 'ㄱ'], ['ㄴ'], ['ㄷ'], ['ㄷ', 'ㄷ'], ['ㄹ'], ['ㅁ'], ['ㅂ'], ['ㅂ', 'ㅂ'], ['ㅅ'], ['ㅅ', 'ㅅ'], ['ㅇ'], ['ㅈ'], ['ㅈ', 'ㅈ'], ['ㅊ'], ['ㅋ'], ['ㅌ'], ['ㅍ'], ['ㅎ'] ];
																																	 
//중성(21)
const jung = [																																	 
['ㅏ'], ['ㅏ','ㅣ'], ['ㅑ'], ['ㅑ','ㅣ'], ['ㅓ'], ['ㅓ','ㅣ'], ['ㅕ'], ['ㅕ','ㅣ'], ['ㅗ'], ['ㅗ','ㅏ'], ['ㅗ', 'ㅏ','ㅣ'], ['ㅗ','ㅣ'], ['ㅛ'], ['ㅜ'], ['ㅜ', 'ㅓ'], ['ㅜ', 'ㅓ','ㅣ'], ['ㅜ', 'ㅣ'], ['ㅠ'], ['ㅡ'], ['ㅡ', 'ㅣ'], ['ㅣ']
];
//종성(28)
const jong = [																																	 
[''], ['ㄱ'], ['ㄱ', 'ㄱ'], ['ㄱ', 'ㅅ'], ['ㄴ'], ['ㄴ', 'ㅈ'], ['ㄴ', 'ㅎ'], ['ㄷ'], ['ㄹ'], ['ㄹ', 'ㄱ'], ['ㄹ', 'ㅁ'], ['ㄹ', 'ㅂ'], ['ㄹ', 'ㅅ'], ['ㄹ', 'ㅌ'], ['ㄹ', 'ㅍ'], ['ㄹ', 'ㅎ'], ['ㅁ'], ['ㅂ'], ['ㅂ', 'ㅅ'], ['ㅅ'], ['ㅅ', 'ㅅ'], ['ㅇ'], ['ㅈ'], ['ㅊ'], ['ㅋ'],['ㅌ'], ['ㅍ'], ['ㅎ']
]


const datall=[
        'ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ',
        'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ',
        'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ',
	
	      'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ',
        'ㄷ', 'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ',
        'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ',
        'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'
			];
	
const hanall=[
        'ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ',
        'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ',
        'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ',
	        'ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ',
        'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ',
        'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ',
	      'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ',
        'ㄷ', 'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ',
        'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ',
        'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'
			];
	
    const 초성 = [
        'ㄱ', 'ㄲ', 'ㄴ', 'ㄷ', 'ㄸ', 'ㄹ', 'ㅁ',
        'ㅂ', 'ㅃ', 'ㅅ', 'ㅆ', 'ㅇ', 'ㅈ', 'ㅉ',
        'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'
    ];

    const 중성 = [
        'ㅏ', 'ㅐ', 'ㅑ', 'ㅒ', 'ㅓ', 'ㅔ', 'ㅕ',
        'ㅖ', 'ㅗ', 'ㅘ', 'ㅙ', 'ㅚ', 'ㅛ', 'ㅜ',
        'ㅝ', 'ㅞ', 'ㅟ', 'ㅠ', 'ㅡ', 'ㅢ', 'ㅣ'
    ];

    const 종성 = [
        '', 'ㄱ', 'ㄲ', 'ㄳ', 'ㄴ', 'ㄵ', 'ㄶ',
        'ㄷ', 'ㄹ', 'ㄺ', 'ㄻ', 'ㄼ', 'ㄽ', 'ㄾ',
        'ㄿ', 'ㅀ', 'ㅁ', 'ㅂ', 'ㅄ', 'ㅅ', 'ㅆ',
        'ㅇ', 'ㅈ', 'ㅊ', 'ㅋ', 'ㅌ', 'ㅍ', 'ㅎ'
    ];

	
function hansplit(글자) {


    const 유니코드_한글_시작점 = 44032;
    const 유니코드_한글_종료점 = 55203;

    const 글자의_유니코드 = 글자.charCodeAt(0);
	 

    if (글자의_유니코드 < 유니코드_한글_시작점 || 글자의_유니코드 > 유니코드_한글_종료점) {
        return [ 글자 ];
    }

    const 상대_크기 = 글자의_유니코드 - 유니코드_한글_시작점;

    const 초성_인덱스 = parseInt(상대_크기 / 588);
    const 중성_인덱스 = parseInt((상대_크기 - (초성_인덱스 * 588)) / 28);
    const 종성_인덱스 = parseInt(상대_크기 % 28);
	
		choindex=초성_인덱스;

	  jungindex=중성_인덱스;
	  jongindex=종성_인덱스;
	
    if (종성[종성_인덱스]) {
        return [
            초성[초성_인덱스],
            중성[중성_인덱스],
            종성[종성_인덱스]
        ];
    }
    return [
        초성[초성_인덱스],
        중성[중성_인덱스]
    ];
}


function get_cjj(mychar, cjj) //초성종성만 제공함
{
					hanhan=hansplit(mychar);
	if(cjj==0)//초성
	{
					if(cho[choindex].length==2) //쌍자음
					{					
						return [cho[choindex][0], cho[choindex][1]];						
  				}
					else
					{
						return [cho[choindex][0]];						
					}
		}
		else if(cjj==1 && hanhan.length>=2) //중성이 있으면
		{
				if(jung[jungindex].length==3)
				{
										//text(jung[jungindex][0] + " " + jung[jungindex][1]+ " " +jung[jungindex][2], w/2, w*11/16);
											return [jung[jungindex][0], jung[jungindex][1], jung[jungindex][2]];						


				}
				else if(jung[jungindex].length==2)
								{
											return [jung[jungindex][0], jung[jungindex][1]];						

								}
				else
											return [jung[jungindex][0]];						
		}
	else if(hanhan.length==3 && cjj==2 ) //종성이 있으면
	{
		    if(jong[jongindex].length==2)
				{
											return [jong[jonggindex][0],jong[jonggindex][1]];						
				}
				else
				{
											return [jong[jonggindex][0]];						

				}
	}
	
}